### DATA Clean

In [4]:
import pandas as pd

In [6]:
customerData = pd.read_csv("../dataset/customerdata.csv")
customerData.head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

In [11]:
len(customerData)

150

In [7]:
customerData.head(2)

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566    4273.90000    3          6.4    1.679181  Big-Screen-lover
1  A14219    3642.44195    2          4.0    2.682023      Sleeping-dog

In [9]:
customerDataCleaned = customerData[(customerData.EMI==3)]

In [10]:
customerDataCleaned.head()

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0   A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
27  F17131   3179.708359    3          6.5    1.100000        Early-bird
33  G16437   3787.328898    3          6.7    1.000000        Early-bird
36  G18402   3402.199381    3          6.5    1.000000        Early-bird
40  H16326   3988.935304    3          6.5    0.900000        Early-bird

In [12]:
len(customerDataCleaned)

19

### 두번째

In [17]:
import pandas as pd

In [18]:
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [45]:
customerDataCleaned = customerData[(customerData.GENDER=="Male") & (customerData.EMAIL>0)]
customerDataCleaned

AttributeError: 'DataFrame' object has no attribute 'GENDER'

In [27]:
a = "Male"

In [29]:
b = a.lower()
b

'male'

In [30]:
b = a.upper()
b

'MALE'

## 인덱스로 조회하기

In [41]:
df1 = customerData.iloc[0:3,1:2]
print(df1)

  PRODUCTGROUP
0       ST0001
1       ST0002
2       ST0001

## 컬럼 조건으로 조회하기

In [37]:
customerData = pd.read_csv("../dataset/kopo_product_volume.csv")
customerData.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464
3      A01       ST0002    201418  134467
4      A01       ST0001    201413  470040

In [53]:
customerDataCleaned = customerData[(customerData.PRODUCTGROUP==ST0002) & (customerData.VOLUME>300000)]
customerDataCleaned

AttributeError: 'DataFrame' object has no attribute 'PRODUCTGROUP'

## 컬럼으로 조회하기

In [48]:
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [54]:
customerDataC = customerData[["CUSTOMERCODE","STATENAME","GENDER"]]
customerDataC.head()

   CUSTOMERCODE STATENAME  GENDER
0       1503989    State2    Male
1       1190338    State2    Male
2       1424715    State2  Female
3       2483305    State2    Male
4       1178802    State2    Male

## 인덱스 및 컬럼 이름을 선택해서 조회하기

In [55]:
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [62]:
customerDataC = customerData.iloc[0:5,[1,3]]
customerDataC.head()

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male

In [64]:
customerDataC = customerData.loc[0:5,["STATENAME","GENDER"]]
customerDataC.head()

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male

## 이상데이터 정제하기

In [66]:
import numpy as np
customerData = pd.read_csv("../dataset/customerdata.csv")
customerData.head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

In [70]:
customerData.dtypes

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT     float64
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

In [74]:
customerData["PRODUCTAGE_NEW"] = np.where(customerData["PRODUCTAGE"]<1,1,\
                                        np.where(customerData["PRODUCTAGE"]<2,2,\
                                        np.where(customerData["PRODUCTAGE"]<3,3,\
                                                 5)))                   
customerData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3

In [75]:
def refining(df):
    if df["PRODUCTAGE"]<1:
        return 1
    elif df["PRODUCTAGE"]<2:
        return 2
    elif df["PRODUCTAGE"]<3:
        return 3
    else:
        return 5

In [77]:
customerData["PRODUCTAGE_NEW2"]=customerData.apply(refining, axis=1)
customerData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3,3

## 데이터 정렬하기 +인덱스를 변경할지 그냥 출력할지

In [81]:
customerData = pd.read_csv("../dataset/customerdata.csv")
customerData.head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

In [83]:
customerData.sort_values(["EMI","AVERAGEPRICE"], ascending=[True,False], inplace=False)
customerData.head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

In [84]:
customerData.sort_values(["EMI","AVERAGEPRICE"], ascending=[True,False], inplace=True)
customerData.head()

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
56  K10712   3419.462596    1          4.4    2.825790      Sleeping-dog
72  O13037   3398.216334    1          4.5    2.994395      Sleeping-dog
46  I14835   3374.091339    1          4.0    2.749678      Sleeping-dog
65  M16452   3353.537290    1          4.0    1.940357      Sleeping-dog
11  C18622   3246.000000    1          5.0    1.891624  Big-Screen-lover

In [85]:
customerData.sort_values(["EMI","AVERAGEPRICE"], ascending=[True,False])
customerData.head()

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
56  K10712   3419.462596    1          4.4    2.825790      Sleeping-dog
72  O13037   3398.216334    1          4.5    2.994395      Sleeping-dog
46  I14835   3374.091339    1          4.0    2.749678      Sleeping-dog
65  M16452   3353.537290    1          4.0    1.940357      Sleeping-dog
11  C18622   3246.000000    1          5.0    1.891624  Big-Screen-lover

## GROUP BY

In [93]:
maxvalue = customerData.\
groupby(["CUSTTYPE","EMI"], as_index=True).\
max()
maxvalue

                      CUSTID  AVERAGEPRICE  DEVICECOUNT  PRODUCTAGE
CUSTTYPE         EMI
Big-Screen-lover 1    C18622   3246.000000          5.0    1.891624
                 2    Z16735   4165.700000          6.9    3.367229
                 3    T11473   4273.900000          6.7    2.055707
Early-bird       1    N14862   2390.083736          6.3    1.000000
                 2    Z19835   4020.245162          6.9    1.300000
                 3    Z13534   4296.873743          6.9    1.100000
Sleeping-dog     1    Y12458   3419.462596          4.5    2.994395
                 2    X19768   4166.533130          5.1    3.483573

## 데이터 연산 rolling시 center(true)를 기준으로 총 3개, (false) 기준이 마지막이되는 3개
## 기준은 order

In [ ]:
order = 3
import math
suboder =

## 데이터 합치기

In [103]:
MasterData= pd.read_csv("../dataset/kopo_region_mst.csv")

In [130]:
MasterData.head()

  REGIONID REGIONNAME
0      A00     AFRICA
1      A01    AMERICA
2      A02      KOREA
3      A03     GERMAN
4      A04     BRAZIL

In [129]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [131]:
aa=pd.merge(selloutData,MasterData, how='left',left_on="REGIONID", right_on="REGIONID")
aa.head(5)

  REGIONID    PRODUCT  YEARWEEK      QTY REGIONNAME
0      A60   PRODUCT4    201402     71.0       THAI
1      A60  PRODUCT59    201402  22275.0       THAI
2      A60  PRODUCT34    201402   4463.0       THAI
3      A60  PRODUCT47    201402      0.0       THAI
4      A60  PRODUCT56    201402     23.0       THAI

In [122]:
len(selloutData)

124658

In [123]:
len(aa)

124658

In [145]:
mergeResult = pd.merge(selloutData, MasterData, left_on="REGIONID", right_on="REGIONID")
[["REGIONID","REGIONNAME", "PRODUCT","YEARWEEK","QTY"]]
mergeResult.head()

  REGIONID    PRODUCT  YEARWEEK      QTY REGIONNAME
0      A60   PRODUCT4    201402     71.0       THAI
1      A60  PRODUCT59    201402  22275.0       THAI
2      A60  PRODUCT34    201402   4463.0       THAI
3      A60  PRODUCT47    201402      0.0       THAI
4      A60  PRODUCT56    201402     23.0       THAI

In [ ]:
len(mergeResult)

In [ ]:
mergeResult[mergeResult["REGIONNAME"].isnull()]

## 타입 변경하기

In [34]:
customerData["GENDER"] = customerData["GENDER"].astypes(float)
customerData.dtypes

AttributeError: 'Series' object has no attribute 'astypes'